; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image1 - mode
	spectrograph0 - mode
	image2 - mode
	Star5 - direction
	Star7 - direction
	Star0 - direction
	Star1 - direction
	Star6 - direction
	Star4 - direction
	Star2 - direction
	GroundStation3 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star7)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star4)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star4)
	(supports instrument5 spectrograph0)
	(supports instrument5 image2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument6 image2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument7 spectrograph0)
	(supports instrument7 image2)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph0)
	(supports instrument8 image2)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star6)
	(supports instrument9 image1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
)
(:goal (and
	(pointing satellite1 Phenomenon12)
	(pointing satellite3 Star5)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 image2)
	(have_image Star10 spectrograph0)
	(have_image Star11 image1)
	(have_image Phenomenon12 image1)
	(have_image Planet13 spectrograph0)
))

)

; plan
1. (turn_to satellite3 star5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star5)
   goals met: 1 of 8
2. (turn_to satellite1 star4 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star4)
   goals met: 1 of 8
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 8
4. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 1 of 8
5. (turn_to satellite1 star10 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star10)
   goals met: 1 of 8
6. (take_image satellite1 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 2 of 8
7. (turn_to satellite1 planet13 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet13)
   goals met: 2 of 8
8. (take_image satellite1 planet13 instrument2 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 3 of 8
9. (turn_to satellite1 phenomenon9 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 8
10. (take_image satellite1 phenomenon9 instrument2 image2)
   added: (have_image phenomenon9 image2)
   goals met: 4 of 8
11. (turn_to satellite1 star11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star11)
   goals met: 4 of 8
12. (take_image satellite1 star11 instrument2 image1)
   added: (have_image star11 image1)
   goals met: 5 of 8
13. (turn_to satellite1 star8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star8)
   goals met: 5 of 8
14. (take_image satellite1 star8 instrument2 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 6 of 8
15. (turn_to satellite1 phenomenon12 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon12)
   goals met: 7 of 8
16. (take_image satellite1 phenomenon12 instrument2 image1)
   added: (have_image phenomenon12 image1)
   goals met: 8 of 8
